app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
    if @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Funky Code Medina"], ["room_number", 345], ["created_at", "2019-05-22 15:34:44.117776"], ["updated_at", "2019-05-22 15:34:44.117776"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-05-20 22:22:10.621237"], ["id", 1]]